app/views/vegam/index.html.erb

                             <select  name="cityName" id="cityName" class="dropdown-menu">
                              	<% cities_array = City.all.map { |city| [city.cityName, city.id] } %>
---
SELECT "cities".* FROM "cities"

    <script>
    			$(document).ready(function() {
    				$("#city").change(function(){

var jsonSCMapping1 = $('#jsonSCMapping').val();
var jsonService1 = $('#jsonService').val();
var jsonSCMapping2 = JSON.parse(''+ jsonSCMapping1 +'');
var jsonService2= JSON.parse(''+ jsonService1 +'');
var options="<option value=''>Select Your Service</option>";
for (var i = 0; i < jsonSCMapping2.length; i++) {
	var cityId =$('#city').val();
    var counter = jsonSCMapping2[i];
 	if(cityId == counter.city_id)
    {
    	console.log("cityId" + cityId);
    	console.log("counterCityID" + counter.city_id);
    for (var j = 0; j < jsonService2.length; j++) {
    	console.log("service_id" + counter.service_id);
    	console.log("jsonservice" + jsonService2[j].id);
	if(counter.service_id == jsonService2[j].id)
{ 	console.log("came here");
options = options + "<option value="+counter.service_id+" >"+jsonService2[j].name+"</option>";
---
SELECT "services".* FROM "services"