app/controllers/booking_controller.rb

def booking
 puts params[:city]
 puts  params[:service]

#  @locality = Locality.where(city_id:params[:city])
   @locality =Locality.find_by_sql(" select * from localities where id in (select locality_id from service_locality_mappings where service_id ='#{params[:service]}' ) ")
  @subService = SubService.where(service_id:params[:service])
---
SELECT "sub_services".* FROM "sub_services" WHERE "sub_services"."service_id" = ?  [["service_id", 1]]

def doBooking
 puts params[:cityId]
 puts params[:serviceId]

  @booking = Booking.new
  @scmapping = ServiceCityMapping.where(service_id: params[:serviceId] , city_id: params[:cityId]).first
  @locality =Locality.where(id:params[:localityId]).first
  puts "id" + @locality.id.to_s
  @booking.locality_id = @locality.id
  @subService = SubService.where(id:params[:subServiceId]).first
  @booking.service_city_mapping_id =  @scmapping
  @booking.email =params[:email]
  @booking.address = params[:address]
  @booking.pin = params[:pin]
  @booking.phoneno = params[:phoneno]
  @booking.name = params[:name]
  @booking.sub_service_id = @subService.id
  @booking.save
#send mail to booking and worker both
UserMailer.booking_email(@booking).deliver


#find a algo to assign a task to worker
@workerMap =WorkerSlMapping.select(:worker_id).distinct.where(locality_id: @locality.id ).map{ |x| x.worker_id }
puts @workerMap
@worker =Worker.where('service_id in (?) and id in (?)', params[:serviceId] ,@workerMap).order('count asc').first

    @booking.worker_id = @worker.id
  WorkerMailer.work_email(@worker , @booking).deliver
  if @worker.count.nil?
---
SELECT  "service_city_mappings".* FROM "service_city_mappings" WHERE "service_city_mappings"."service_id" = ? AND "service_city_mappings"."city_id" = ?  ORDER BY "service_city_mappings"."id" ASC LIMIT 1  [["service_id", 2], ["city_id", 2]]
SELECT  "localities".* FROM "localities" WHERE "localities"."id" = ?  ORDER BY "localities"."id" ASC LIMIT 1  [["id", 5]]
SELECT  "sub_services".* FROM "sub_services" WHERE "sub_services"."id" = ?  ORDER BY "sub_services"."id" ASC LIMIT 1  [["id", 1]]
INSERT INTO "bookings" ("locality_id", "email", "phoneno", "sub_service_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["locality_id", 5], ["email", ""], ["phoneno", ""], ["sub_service_id", 1], ["created_at", "2015-07-21 12:35:56.822326"], ["updated_at", "2015-07-21 12:35:56.822326"]]
SELECT DISTINCT "worker_sl_mappings"."worker_id" FROM "worker_sl_mappings" WHERE "worker_sl_mappings"."locality_id" = ?  [["locality_id", 5]]
SELECT  "workers".* FROM "workers" WHERE (service_id in ('2') and id in (1,2))  ORDER BY count asc LIMIT 1
SELECT "workers"."id" FROM "workers" WHERE "workers"."service_id" = ?  [["service_id", 2]]

  else
  @worker.count +=1
  end
  @worker.save
  @booking.save
---
UPDATE "workers" SET "count" = ?, "updated_at" = ? WHERE "workers"."id" = 1  [["count", 1], ["updated_at", "2015-07-22 07:14:30.797594"]]
UPDATE "bookings" SET "worker_id" = ?, "updated_at" = ? WHERE "bookings"."id" = 21  [["worker_id", 1], ["updated_at", "2015-07-22 07:14:31.063031"]]