app/controllers/booking_controller.rb

def booking
 puts params[:city]
 puts  params[:service]
  @locality = Locality.where(city_id:params[:city])
---
SELECT "localities".* FROM "localities" WHERE "localities"."city_id" = ?  [["city_id", 3]]