app/controllers/vegam_controller.rb

  def index
   @user = User.new
   @city  =City.all
   @servicecityMapping = ServiceCityMapping.all
    @jsonSCMapping = @servicecityMapping.to_json
   @service = Service.all
---
SELECT "cities".* FROM "cities"
SELECT "service_city_mappings".* FROM "service_city_mappings"
SELECT "services".* FROM "services"

  def signin
         puts(params[:user][:email])
		 user2 = User.find_by_email(params[:user][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", ""]]

  def signup
       @user=User.new(email:params[:user][:email],fname:params[:user][:fname],lname:params[:user][:lname],dob:params[:user][:dob],password:params[:user][:password],gender:params[:user][:gender],phone:params[:user][:phone])
	   if (params[:password].to_s == params[:confirm_password].to_s)
	      @user.password = Digest::SHA1.hexdigest(@user.password);
	     @user.save
---
INSERT INTO "users" ("email", "fname", "lname", "dob", "password", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["email", ""], ["fname", ""], ["lname", ""], ["dob", ""], ["password", ""], ["phone", ""], ["created_at", "2015-07-13 12:34:08.183905"], ["updated_at", "2015-07-13 12:34:08.183905"]]

  def fbauth

    puts params[:fblogin].to_s


# HTTPClient#get_content follows redirects and returns a string
# HTTPClient#get takes a `:follow_redirect => true` option
 url = 'https://graph.facebook.com/me?fields=email&access_token='+params[:fblogin].to_s;
 uri = URI.parse(url.to_s)
http = Net::HTTP.new(uri.host, uri.port)
http.use_ssl = true
puts uri.request_uri.to_s
request = Net::HTTP::Get.new(uri.request_uri)

response = http.request(request)
puts response.body.to_s
puts response.to_s





if response.body.to_s.include? "email"

  puts JSON.parse(response.body.to_s)['email'];
  puts User.find_by_email(JSON.parse(response.body.to_s)['email'])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "kartikkhatri001@gmail.com"]]

if user2.nil?

 @user3=  User.new(email:JSON.parse(response.body.to_s)['email'])
  @user3.save
---
INSERT INTO "users" ("email", "created_at", "updated_at") VALUES (?, ?, ?)  [["email", "kartikkhatri001@gmail.com"], ["created_at", "2015-07-22 17:24:09.490523"], ["updated_at", "2015-07-22 17:24:09.490523"]]