app/controllers/workers_controller.rb

SELECT "workers".* FROM "workers"
---
  def index
    @workers = Worker.all

SELECT  "workers".* FROM "workers" WHERE "workers"."id" = ? LIMIT 1  [["id", 2]]
---
  def edit
    @worker=Worker.find(params[:id])

INSERT INTO "workers" ("name", "city", "subcity", "peramadd", "phoneno", "email", "service", "contractbasis", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @worker = Worker.new(worker_params)
    @city =City.find(params[:worker][:city])
    puts("***************Debugging******************")
    puts(params[:subcity])
    @locality=Locality.find(params[:subcity])
    puts(@locality.subCity)
    @worker.city=@city.cityName
    @worker.subcity=@locality.subCity
    respond_to do |format|
      if @worker.save

DELETE FROM "workers" WHERE "workers"."id" = ?  [["id", 3]]
---
  def destroy
    @worker.destroy

SELECT  "workers".* FROM "workers" WHERE "workers"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_worker
      @services=Service.all
      @cities=City.all
      @worker = Worker.find(params[:id])